Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
#if APP_ROLE_TX_ONLY
  if ((g_pairing_mode == 0U) && (raw == 0U)) {
    return;
  }

  if (raw != g_pair_last_raw) {
    g_pair_last_raw = raw;
    g_pair_raw_change_tick = now;
  }

  if ((now - g_pair_raw_change_tick) < KEY_DEBOUNCE_MS) {
    return;
  }

  if (raw != g_pair_stable) {
    g_pair_stable = raw;

    DebugPrint("[KEY] L=");
    DebugPrintDec((uint16_t)l_raw);
    DebugPrint(" R=");
    DebugPrintDec((uint16_t)r_raw);
    DebugPrint(" LR=");
    DebugPrintDec((uint16_t)raw);
    DebugPrint("\r\n");

    if (g_pair_stable == 1U) {
      g_pair_press_start_tick = now;
      g_pair_long_done = 0U;
      DebugPrint("[PAIR] LR down\r\n");
    } else {
      g_pair_press_start_tick = 0U;
      g_pair_long_done = 0U;
      DebugPrint("[PAIR] LR up\r\n");
    }
  }

  if ((g_pair_stable == 1U) && (g_pair_long_done == 0U) && (g_pair_press_start_tick != 0U)) {
    uint32_t held = now - g_pair_press_start_tick;

    if (held >= KEY_LONG_MS) {
      g_pairing_mode = 1U;
      g_pairing_enter_tick = now;
      g_pair_led_tick = now;
      DebugPrint("[PAIR] enter (tx)\r\n");
      g_pair_long_done = 1U;
      g_tx_need_send = 1U;
    }
  }
#else
  (void)l_raw;
  (void)r_raw;
  (void)raw;
#endif
}

/* TX 进入低功耗前的统一收敛：
 * 1) RF 无条件下发睡眠
 * 2) 三线固定为 CSN=高、SCK=低、DATA=低，避免悬空/毛刺导致模块额外耗电
 * 3) 关闭串口，减少静态功耗 */
static void LowPowerDiag_LogRfPins(void)
{
#if LOWPOWER_DIAG_ENABLE
  uint8_t csn = (HAL_GPIO_ReadPin(RF_CSN_GPIO_Port, RF_CSN_Pin) == GPIO_PIN_SET) ? 1U : 0U;
  uint8_t sck = (HAL_GPIO_ReadPin(RF_SCK_GPIO_Port, RF_SCK_Pin) == GPIO_PIN_SET) ? 1U : 0U;
  uint8_t dat = (HAL_GPIO_ReadPin(RF_DATA_GPIO_Port, RF_DATA_Pin) == GPIO_PIN_SET) ? 1U : 0U;

  DebugPrint("[LP-RF-PIN] CSN=");
  DebugPrintDec(csn);
  DebugPrint(" SCK=");
  DebugPrintDec(sck);
  DebugPrint(" DAT=");
  DebugPrintDec(dat);
  DebugPrint("\r\n");
#endif
}

static void LowPowerDiag_LogWakeFlags(void)
{
#if LOWPOWER_DIAG_ENABLE
  uint8_t wufi = (__HAL_PWR_GET_FLAG(PWR_FLAG_WUFI) != 0U) ? 1U : 0U;
  uint8_t wuf1 = (__HAL_PWR_GET_FLAG(PWR_FLAG_WUF1) != 0U) ? 1U : 0U;
  uint8_t wuf2 = (__HAL_PWR_GET_FLAG(PWR_FLAG_WUF2) != 0U) ? 1U : 0U;

  DebugPrint("[LP-WAKE] cnt=");
  DebugPrintDec((uint16_t)(g_lp_wake_cnt & 0xFFFFU));
  DebugPrint(" WUFI=");
  DebugPrintDec(wufi);
  DebugPrint(" WUF1=");
  DebugPrintDec(wuf1);
  DebugPrint(" WUF2=");
  DebugPrintDec(wuf2);
  DebugPrint("\r\n");
#endif
}

static void EnterTxLowPower(void)
{
  /* 诊断打印必须在串口关闭前执行 */
#if LOWPOWER_DIAG_ENABLE
  g_lp_enter_cnt++;
  DebugPrint("[LP-ENTER] cnt=");
  DebugPrintDec((uint16_t)(g_lp_enter_cnt & 0xFFFFU));
  DebugPrint("\r\n");
#endif

  RF_Link_Sleep();
  g_rf_sleeping = 1U;

  HAL_GPIO_WritePin(RF_CSN_GPIO_Port, RF_CSN_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(RF_SCK_GPIO_Port, RF_SCK_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(RF_DATA_GPIO_Port, RF_DATA_Pin, GPIO_PIN_RESET);

#if LOWPOWER_DIAG_ENABLE
  LowPowerDiag_LogRfPins();
#endif

  /* 低功耗前关闭串口，减少外设静态功耗 */
  HAL_UART_DeInit(&huart1);

#if (TX_LOWPOWER_MODE == TX_LOWPOWER_MODE_STOP)
  /* STOP 前暂停 1ms Tick 与 TIM14，避免高频周期唤醒导致电流居高不下 */
  HAL_TIM_Base_Stop_IT(&htim14);
  HAL_SuspendTick();
#endif
}

/* TX 退出低功耗后的统一恢复：
 * STOP 唤醒后需要先恢复系统时钟，再恢复 Tick/TIM14，最后初始化串口。
 * SLEEP 唤醒仅需恢复串口。 */
static void ExitTxLowPower(void)
{
#if (TX_LOWPOWER_MODE == TX_LOWPOWER_MODE_STOP)
  SystemClock_Config();
  HAL_ResumeTick();
  HAL_TIM_Base_Start_IT(&htim14);
#endif
  MX_USART1_UART_Init();

  g_tx_lp_wake_tick = HAL_GetTick();

#if LOWPOWER_DIAG_ENABLE
  g_lp_wake_cnt++;
  LowPowerDiag_LogWakeFlags();
#endif

#if APP_ROLE_TX_ONLY
  g_tx_lp_wake_tick = HAL_GetTick();
#endif
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_TIM1_Init();
  MX_TIM14_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */
  HAL_TIM_Base_Start_IT(&htim14);
  DevId_LoadFromFlash();
  DebugPrint("[FW] " FW_VERSION "\r\n");

  DebugPrint("[CFG] role=");
#if APP_ROLE_TX_ONLY
  DebugPrint("TX");
#else
  DebugPrint("RX");
#endif
  DebugPrint(" link_test=");
#if APP_RF_LINK_TEST
  DebugPrint("1");
#else
  DebugPrint("0");
#endif
  DebugPrint(" lowpower=");
#if (TX_LOWPOWER_MODE == TX_LOWPOWER_MODE_STOP)
  DebugPrint("STOP");
#else
  DebugPrint("SLEEP");
#endif
  DebugPrint("\r\n");

  DebugPrint("[DEV] local=");
  DebugPrintHex((const uint8_t *)&g_dev_id_local, 2);
  DebugPrint(" paired=");
  DebugPrintHex((const uint8_t *)&g_dev_id_paired, 2);
  DebugPrint("\r\n");
  DebugPrint("[CMD] type HELP\r\n");

#if APP_ROLE_TX_ONLY
  /* TX 上电自检：LED 快闪 1 次 */
  HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
  HAL_Delay(70);
  HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
#endif

  /* PA3 已切换为 MOS_L_HI（GPIO 输出），不再作为 PWM 通道 */
  HAL_Delay(100);

  /* 单路全局 PWM 启动（PA2=TIM1_CH3） */
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);

  /* 使能 CCR 预装载：比较值在更新事件统一生效 */
  __HAL_TIM_ENABLE_OCxPRELOAD(&htim1, TIM_CHANNEL_3);

  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, 0);
  Channel_ApplyMask(0U);



#if APP_ROLE_TX_ONLY && TX_KEY_R_DEBUG_ONLY
  DebugPrint("RF Bypass (R-key debug only)\r\n");
#else
    /* RF 模块初始化 */
  DebugPrint("RF Init...\r\n");
  RF_Link_Init();
  DebugPrint("RF Init OK\r\n");

#if APP_ROLE_RX_ONLY
  /* RX 角色：上电进入接收模式 */
  DebugPrint("RF Config RX...\r\n");
  RF_Link_ConfigRx(RF_RX_CHANNEL);
  g_rf_mode = 0;
#elif APP_ROLE_TX_ONLY
  /* TX 角色：上电进入发送模式并保温一段时间，再按空闲策略休眠 */
  DebugPrint("RF Config TX...\r\n");
  RF_Link_ConfigTx(RF_TX_CHANNEL);
  g_rf_mode = 1;
  g_tx_rf_awake = 1U;
  g_tx_rf_wakeup_tick = HAL_GetTick();
  g_tx_boot_warm_done = 0U;
  g_tx_boot_warm_until = HAL_GetTick() + RF_TX_BOOT_WARM_MS;
  g_tx_first_event_done = 0U;
  DebugPrint("[RF] TX warm@boot\r\n");
#endif
  DebugPrint("RF Ready\r\n");
#endif
  
  /* 调试：确认TX固定时间 */
  DebugPrint("[SYNC] TX fixed at ");
  DebugPrintDec(SYNC_TX_TIME_MS);
  DebugPrint("ms, Window: ");
  DebugPrintDec(SYNC_TX_TIME_MS);
  DebugPrint("- ");
  DebugPrintDec(SYNC_TX_TIME_MS + 50U);
  DebugPrint("ms\r\n");





